_src/posts/java-blowfish-cbc.org
# -*- coding: utf-8-unix; -*-
#+TITLE:       用java实现blowfish-cbc编码解码算法
#+AUTHOR:      Bruce Asu
#+EMAIL:       bruceasu@163.com
#+DATE:        <2016-07-05 20:00>
#+filetags: java
#+DESCRIPTION: 用java实现blowfish-cbc编码解码算法，以便与C,php等语言对接...

#+LANGUAGE:    en
#+OPTIONS:     H:7 num:nil toc:t \n:nil ::t |:t ^:nil -:nil f:t *:t <:nil

* 前言

在平时运用中，往往会遇到不同语言之间的通讯，比如php中实现一种加密传输算法，需要
用Java进行解码，这时就要保持不同语言加密解密的一致性，才能正常通信。本文就通过
Java实现php中mcrypt进行des加密相同的效果。其中引入了不太被人关注的“初始化向量”，
并对主要代码进行了注释。


