posts/java-blowfish-cbc.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://bruceasu.github.io/rss.xml"
      title="RSS feed for https://bruceasu.github.io/"/>
<title>用java实现blowfish-cbc编码解码算法</title>
<meta name="author" content="Bruce">
<meta name="referrer" content="no-referrer">
<link href= "/styles/org-manual.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rel="stylesheet" href="/styles/font.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/post.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/post_mobile.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/navigatebar.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/navigatebar_mobile.css">
<link rel="stylesheet" href="/theme/highlight.css">

</head>
<body>
<div class="navigatebar">
    <div class="navigatebar-button navigatebar-mine">
        <a href="/index.html">Free World</a>
    </div>
    <div class="navigatebar-slogan">
        「生活可以更简单, 欢迎来到我的开源世界」
    </div>
    <div class="navigatebar-button">
        <a href="/index.html">Home</a>
    </div>
    <div class="navigatebar-button">
        <a href="/tags.html">Tags</a>
    </div>
    <div class="navigatebar-button">
        <a href="/rss.xml">Feeds</a>
    </div>
    <div class="navigatebar-button navigatebar-about">
        <a href="/about.html">About</a>
    </div>
</div>

      <div class="content-area">
<div class="title">用java实现blowfish-cbc编码解码算法</div>
<div class="category-area"><a href="https://bruceasu.github.io/tags.html#java"><div class="category">java</div></a> </div>
<div class="char-counter">2016-07-05</div>
        <div id="content">
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcb69210">前言</a></li>
<li><a href="#orga8ae6a4">Java代码</a></li>
<li><a href="#orgc34dea6">其他语言同类实现方法介绍</a>
<ul>
<li><a href="#org666bf67">Php：</a></li>
<li><a href="#org4f49c32">C*：</a></li>
</ul>
</li>
<li><a href="#orgc164195">DES加密算法介绍</a></li>
<li><a href="#org1c4708d">基本原理</a>
<ul>
<li><a href="#org9611df1">常见加密模式介绍：</a>
<ul>
<li><a href="#orgd88bfad">ECB(Electronic Code Book:电码本)</a></li>
<li><a href="#org5945a2e">CBC(Cipher Block Chaining:密码分组链接)</a></li>
<li><a href="#orgb7ff316">CFB(Cipher FeedBack:密码反馈)</a></li>
<li><a href="#orgb4cfd8a">OFB(Output FeedBack:输出反馈)</a></li>
</ul>
</li>
<li><a href="#org56f33ef">本文采用的是CBC(Cipher Block Chaining:密码分组链接)的模式。</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-orgcb69210" class="outline-2">
<h2 id="orgcb69210">前言</h2>
<div class="outline-text-2" id="text-orgcb69210">
<p>
在平时运用中，往往会遇到不同语言之间的通讯，比如php中实现一种加密传输算法，需要
用Java进行解码，这时就要保持不同语言加密解密的一致性，才能正常通信。本文就通过
Java实现php中mcrypt进行des加密相同的效果。其中引入了不太被人关注的“初始化向量”，
并对主要代码进行了注释。
</p>
</div>
</div>
