posts/java-blowfish-cbc.html


<div id="outline-container-orga8ae6a4" class="outline-2">
<h2 id="orga8ae6a4">Java代码</h2>
<div class="outline-text-2" id="text-orga8ae6a4">
<div class="org-src-container">
<pre class="src src-java">
<span style="font-style: italic;">/**</span>
<span style="font-style: italic;">&#160;* &#29992;java&#23436;&#25104;DES&#23545;&#31216;&#21152;&#23494;</span>
<span style="font-style: italic;">&#160;* BlowFish &#31639;&#27861;&#29992;&#26469;&#21152;&#23494; 64Bit &#38271;&#24230;&#30340;&#23383;&#31526;&#20018;</span>
<span style="font-style: italic;">&#160;* &#29992; BlowFish &#31639;&#27861;&#21152;&#23494;&#20449;&#24687;,&#38656;&#35201;&#20004;&#20010;&#36807;&#31243;:</span>
<span style="font-style: italic;">&#160;* 1.&#23494;&#38053;&#39044;&#22788;&#29702;</span>
<span style="font-style: italic;">&#160;* 2.&#20449;&#24687;&#21152;&#23494;</span>
<span style="font-style: italic;">&#160;*</span>
<span style="font-style: italic;">&#160;* by&#160;tester&#160;2010-11-04</span>
<span style="font-style: italic;">&#160;*/</span>
<span style="font-weight: bold;">public</span>&#160;<span style="font-weight: bold;">class</span>&#160;BlowfishTest {
&#160;&#160;&#160;&#160;&#160;&#160; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#23494;&#38053;</span>
&#160;&#160;&#160;&#160;&#160;&#160;&#160;<span style="font-weight: bold;">public</span>&#160;<span style="font-weight: bold;">static</span>&#160;<span style="font-weight: bold;">final</span>&#160;String&#160;ENCRYPT_KEY&#160;= <span style="font-style: italic;">"WkoxWT0kJik="</span>;
&#160;&#160;&#160;&#160;&#160;&#160; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#21021;&#22987;&#21270;&#21521;&#37327;</span>
&#160;&#160;&#160;&#160;&#160;&#160;&#160;<span style="font-weight: bold;">public</span>&#160;<span style="font-weight: bold;">static</span>&#160;<span style="font-weight: bold;">final</span>&#160;String&#160;INITIALIZATION_VECTOR&#160;= <span style="font-style: italic;">"cnBHdE9F"</span>;
&#160;&#160;&#160;&#160;&#160;&#160; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#36716;&#25442;&#27169;&#24335;</span>
&#160;&#160;&#160;&#160;&#160;&#160;&#160;<span style="font-weight: bold;">public</span>&#160;<span style="font-weight: bold;">static</span>&#160;<span style="font-weight: bold;">final</span>&#160;String&#160;TRANSFORMATION&#160;= <span style="font-style: italic;">"Blowfish/CBC/PKCS5Padding"</span>;
&#160;&#160;&#160;&#160;&#160;&#160; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#23494;&#38053;&#31639;&#27861;&#21517;&#31216;</span>
&#160;&#160;&#160;&#160;&#160;&#160;&#160;<span style="font-weight: bold;">public</span>&#160;<span style="font-weight: bold;">static</span>&#160;<span style="font-weight: bold;">final</span>&#160;String&#160;BLOWFISH&#160;= <span style="font-style: italic;">"Blowfish"</span>;
&#160;&#160;&#160;&#160;&#160;&#160; <span style="font-style: italic;">/**</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;* &#21152;&#23494;</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*&#160;@param&#160;key</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; &#23494;&#38053;</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*&#160;@param&#160;text</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; &#21152;&#23494;&#25991;&#26412;</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*&#160;@param&#160;initializationVector</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; &#21021;&#22987;&#21270;&#21521;&#37327;</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*/</span>
&#160;&#160;&#160;&#160;&#160;&#160;&#160;<span style="font-weight: bold;">public</span>&#160;<span style="font-weight: bold;">static</span>&#160;String encrypt(<span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">key</span>, <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">text</span>, <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">initializationVector</span>)
&#160;&#160;&#160;&#160;&#160;&#160; &#160;&#160;&#160;&#160;&#160;<span style="font-weight: bold;">throws</span>&#160;Exception {
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#26681;&#25454;&#32473;&#23450;&#30340;&#23383;&#33410;&#25968;&#32452;&#26500;&#36896;&#19968;&#20010;&#23494;&#38053;&#160; Blowfish-&#19982;&#32473;&#23450;&#30340;&#23494;&#38053;&#20869;&#23481;&#30456;&#20851;&#32852;&#30340;&#23494;&#38053;&#31639;&#27861;&#30340;&#21517;&#31216;</span>
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; SecretKeySpec sksSpec =&#160;<span style="font-weight: bold;">new</span>&#160;SecretKeySpec(key.getBytes(),&#160;BLOWFISH);
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#20351;&#29992; initializationVector &#20013;&#30340;&#23383;&#33410;&#20316;&#20026; IV &#26469;&#26500;&#36896;&#19968;&#20010; IvParameterSpec &#23545;&#35937;</span>
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; AlgorithmParameterSpec iv =&#160;<span style="font-weight: bold;">new</span>&#160;IvParameterSpec(initializationVector.getBytes());
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#36820;&#22238;&#23454;&#29616;&#25351;&#23450;&#36716;&#25442;&#30340; Cipher &#23545;&#35937;</span>
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; Cipher cipher = Cipher.getInstance(TRANSFORMATION);
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#29992;&#23494;&#38053;&#21644;&#38543;&#26426;&#28304;&#21021;&#22987;&#21270;&#27492; Cipher</span>
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; cipher.init(<span style="font-weight: bold; text-decoration: underline;">Cipher</span>.ENCRYPT_MODE, sksSpec, iv);
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#21152;&#23494;&#25991;&#26412;</span>
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;<span style="font-weight: bold; text-decoration: underline;">byte</span>[] encrypted = cipher.doFinal(text.getBytes());
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;<span style="font-weight: bold;">return</span>&#160;<span style="font-weight: bold;">new</span>&#160;String(Hex.encodeHex(encrypted));
&#160;&#160;&#160;&#160;&#160;&#160; }
&#160;&#160;&#160;&#160;&#160;&#160; <span style="font-style: italic;">/**</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;* &#35299;&#23494;</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*&#160;@param&#160;key</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; &#23494;&#38053;</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*&#160;@param&#160;text</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; &#21152;&#23494;&#25991;&#26412;</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*&#160;@param&#160;initializationVector</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; &#21021;&#22987;&#21270;&#21521;&#37327;</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*/</span>
&#160;&#160;&#160;&#160;&#160;&#160;&#160;<span style="font-weight: bold;">public</span>&#160;<span style="font-weight: bold;">static</span>&#160;String decrypt(<span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">key</span>, <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">text</span>, <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">initializationVector</span>)
&#160;&#160;&#160;&#160;&#160;&#160; &#160;&#160;&#160;&#160;&#160;<span style="font-weight: bold;">throws</span>&#160;Exception {
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;<span style="font-weight: bold; text-decoration: underline;">byte</span>[] encrypted =&#160;<span style="font-weight: bold; text-decoration: underline;">null</span>;
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;<span style="font-weight: bold;">try</span>{
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; encrypted = Hex.decodeHex(text.toCharArray());
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; }&#160;<span style="font-weight: bold;">catch</span>&#160;(<span style="font-weight: bold; text-decoration: underline;">Exception</span> <span style="font-weight: bold; font-style: italic;">e</span>)
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; {
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; e.printStackTrace();
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; }
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; SecretKeySpec skeSpect =&#160;<span style="font-weight: bold;">new</span>&#160;SecretKeySpec(key.getBytes(),&#160;BLOWFISH);
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; AlgorithmParameterSpec iv =&#160;<span style="font-weight: bold;">new</span>&#160;IvParameterSpec(initializationVector.getBytes());
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; Cipher cipher = Cipher.getInstance(TRANSFORMATION);
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; cipher.init(<span style="font-weight: bold; text-decoration: underline;">Cipher</span>.DECRYPT_MODE, skeSpect, iv);
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;<span style="font-weight: bold; text-decoration: underline;">byte</span>[] decrypted = cipher.doFinal(encrypted);
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;<span style="font-weight: bold;">return</span>&#160;<span style="font-weight: bold;">new</span>&#160;String(decrypted);
&#160;&#160;&#160;&#160;&#160;&#160; }
&#160;&#160;&#160;&#160;&#160;&#160; <span style="font-style: italic;">/**</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;* Base64&#23383;&#31526;&#35299;&#30721;</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*&#160;@param&#160;base64String</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; -- &#34987;&#35299;&#30721;&#23383;&#31526;</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*&#160;@return&#160;&#35299;&#30721;&#21518;&#23383;&#31526;</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*/</span>
&#160;&#160;&#160;&#160;&#160;&#160;&#160;<span style="font-weight: bold;">public</span>&#160;<span style="font-weight: bold;">static</span>&#160;String base64Decoder(<span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">base64String</span>) {
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;<span style="font-weight: bold;">if</span>(StringUtils.isEmpty(base64String))
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; {
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;<span style="font-weight: bold;">return</span>&#160;base64String;
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; }
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;<span style="font-weight: bold;">else</span>
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; {
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;<span style="font-weight: bold;">return</span>&#160;<span style="font-weight: bold;">new</span>&#160;String(Base64.decodeBase64(base64String));
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; }
&#160;&#160;&#160;&#160;&#160;&#160; }
&#160;&#160;&#160;&#160;&#160;&#160; <span style="font-style: italic;">/**</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;* Base64&#23383;&#31526;&#32534;&#30721;</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*&#160;@param&#160;sourceString</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; -- &#23383;&#31526;</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*&#160;@return&#160;&#32534;&#30721;&#21518;&#23383;&#31526;</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*/</span>
&#160;&#160;&#160;&#160;&#160;&#160;&#160;<span style="font-weight: bold;">public</span>&#160;<span style="font-weight: bold;">static</span>&#160;String base64Encoder(<span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">sourceString</span>) {
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;<span style="font-weight: bold;">if</span>(StringUtils.isEmpty(sourceString))
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; {
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;<span style="font-weight: bold;">return</span>&#160;sourceString;
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; }
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;<span style="font-weight: bold;">else</span>
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; {
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;<span style="font-weight: bold;">return</span>&#160;Base64.encodeBase64String(sourceString.getBytes());
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; }
&#160;&#160;&#160;&#160;&#160;&#160; }
&#160;&#160;&#160;&#160;&#160;&#160; <span style="font-style: italic;">/**</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*&#160;@param&#160;&#27979;&#35797;&#26041;&#27861;</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; &#160;*/</span>
&#160;&#160;&#160;&#160;&#160;&#160;&#160;<span style="font-weight: bold;">public</span>&#160;<span style="font-weight: bold;">static</span>&#160;<span style="font-weight: bold; text-decoration: underline;">void</span>&#160;main(<span style="font-weight: bold; text-decoration: underline;">String</span>[] <span style="font-weight: bold; font-style: italic;">args</span>) {
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#160;TODO&#160;Auto-generated method stub</span>
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;<span style="font-weight: bold;">try</span>&#160;{
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; String encryptStr =&#160;base64Encoder(encrypt(ENCRYPT_KEY, <span style="font-style: italic;">"&#160;tester&#160;"</span>,INITIALIZATION_VECTOR));
&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; System.out.print(<span style="font-style: italic;">"tester&#21152;&#23494;&#21518;&#24471;&#21040;&#65306;"</span> + encryptStr +<span style="font-style: italic;">""</span>n<span style="font-weight: bold;">"</span><span style="font-style: italic;">);</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; String decryptStr =&#160;decrypt(ENCRYPT_KEY,&#160;base64Decoder(encryptStr),&#160;INITIALIZATION_VECTOR);</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; System.out.print(encryptStr+"</span>&#35299;&#23494;&#21518;&#24471;&#21040;&#65306;<span style="font-weight: bold;">"</span><span style="font-style: italic;">+decryptStr);</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; }&#160;catch&#160;(Exception e) {</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; //&#160;TODO&#160;Auto-generated catch block</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; e.printStackTrace();</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; }</span>
<span style="font-style: italic;">&#160;&#160;&#160;&#160;&#160;&#160; }</span>
<span style="font-style: italic;">}</span>
</pre>
</div>


<p>
实行结果：
</p>
<pre class="example">

tester加密后得到：MzA2YThlZDFlNjI2MmYwYTc2Y2VlZTc5M2ZjMDQ0YjI=
MzA2YThlZDFlNjI2MmYwYTc2Y2VlZTc5M2ZjMDQ0YjI=解密后得到：tester


</pre>
</div>
</div>
