_src/posts/java-blowfish-cbc.org
* 其他语言同类实现方法介绍
** Php：
: string mcrypt\_cbc ( int $cipher , string $key , string $data , int $mode [, string$iv ] )
** C*：
: CryptoStream cs = new CryptoStream(ms, des.CreateEncryptor(), CryptoStreamMode.Write)

* DES加密算法介绍

DES算法为密码体制中的对称密码体制，又被成为美国数据加密标准，是1972年美国IBM公司
研制的对称密码体制加密算法。其密钥长度为56位，明文按64位进行分组，将分组后的明文
组和56位的密钥按位替代或交换的方法形成密文组的加密方法。


* 基本原理

入口参数有三个:key、data、mode。 key为加密解密使用的密钥，data为加密解密的数据，
mode为其工作模式。当模式为加密模式时，明文按照64位进行分组，形成明文组，key用于
对数据加密，当模式为解密模式时，key用于对数据解密。实际运用中，密钥只用到了64位
中的56位，这样才具有高的安全性。

DES( Data Encryption Standard)算法，于1977年得到美国政府的正式许可，是一种用56位
密钥来加密64位数据的方法。虽然56位密钥的DES算法已经风光不在,而且常有用Des加密的
明文被破译的报道,但是了解一下昔日美国的标准加密算法总是有益的,而且目前DES算法得
到了广泛的应用,在某些场合,仍然发挥着余热。


** 常见加密模式介绍：

*** ECB(Electronic Code Book:电码本)

ECB是最简单的模式，同样的明文分组总是加密成相同的密文分组。这对于发送单一的块数
据来说是非常好的，如密钥。但对执行一个加密的信息流来说不是很好，因为如果相同的明
文多次发送以后，同样的密文也会被多次发送。

ECB最大的弱点是对每一个块用相同的方式进行加密。如果我们的密钥或者数据不断发生变
化，ECB是完全安全的。但是如果类似的块经过同样的密钥加密发出以后，攻击者可能获得
一些我们并不想让别人知道的信息。

*** CBC(Cipher Block Chaining:密码分组链接)

CBC模式改变了加密方式，同样的明文分组不一定加密或解密同样的密文块，因此解决了ECB
存在的主要问题。CBC使用前一分组的信息加密当前分组。因此和ECB模式大不相同。这个方
法依然存在问题，那就是相同的信息仍然加密成相同的密文，因为所有的分组是同时变成密
文分组的。为了解决这个问题，我们引入一个Initial ization Vector(初始化向量)，也就
是前不久有人问到的IV问题。IV仅仅是一个初始化加密程序的随机数。它无需秘密保存，但
队每一个信息来说它都是不同的，通过这个方式，即使有两条相同的信息，只要他们有不同
的IV，那么他们加密后的密文也是不同的。从这个意义上来说，初始化向量无疑就和口令加
密过程中使用的盐值是一样的。

CBC很适合文本传输，但它每一次都需要传送一个完整的数据块，一般选8个字符。

*** CFB(Cipher FeedBack:密码反馈)

CFB的工作方式与CBC类似，但它可以执行更小的数据块，典型的有8位，这非常适合加密像
聊天对话这样的信息，因为每次可以发送单一的字节数据块。和CBC一样，C FB也需要一个
IV，且相同及钥发送的每条信息的IV都必须是唯一的。

*** OFB(Output FeedBack:输出反馈)

OFB除了在传输中能给数据提供更好的保护，防止数据丢失外，其他和CFB类似。密文中一位
出错，也只造成明文中的一位出错，其他的方式会造成整个块丢失。

** 本文采用的是CBC(Cipher Block Chaining:密码分组链接)的模式。
